Tekla Open API Reference for Tekla Structures 2025
ModelHistory Methods
The ModelHistory type exposes the following members.
Methods
Name | Description
GetCurrentModificationStamp |  Obsolete.
 Gets the current modification stamp from the model.
GetDeletedObjects |  Obsolete.
 Gets a list of the objects that have been deleted after the modification stamp.
GetDeletedObjectsWithType |  Obsolete.
 Gets based on type a list of the objects that have been deleted after the modification stamp.
GetLocalChanges
Get changes which are not written out.
GetModifications(String, ModificationStamp)
Lookup modifications since previous call of TakeModifications() without resetting the modstamp
GetModifications(String, IEnumerable<ModelObject.ModelObjectEnum>, ModificationStamp)
Lookup modifications since previous call of TakeModifications() without resetting the modstamp, with object type filtering
GetModifiedObjects |  Obsolete.
 Gets a list of the objects that have been added or modified after the modification stamp.
GetModifiedObjectsWithType |  Obsolete.
 Gets based on type a list of the objects that have been added or modified after the modification stamp.
GetNotSharedObjects
Get object which are was created or modified since last ModelSharing WriteOut.
TakeModifications(String, ModificationStamp)
Take modifications since previous call.
TakeModifications(String, IEnumerable<ModelObject.ModelObjectEnum>, ModificationStamp)
Take modifications since previous call, with object type filtering.
UpdateModificationStampToLatest
 Updates the modification stamp to latest.
Top
See Also
Reference
ModelHistory Class
Tekla.Structures.Model.History Namespace